## Proxmox Terraform Plan
  ```terraform
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # proxmox_vm_qemu.vm["k8s-observability.yaml"] will be created
  + resource "proxmox_vm_qemu" "vm" {
      + additional_wait        = 5
      + agent                  = 1
      + agent_timeout          = 90
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = (known after apply)
      + cipassword             = (sensitive value)
      + ciupgrade              = false
      + ciuser                 = "suporte"
      + clone                  = "ubuntu24-template"
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + current_node           = (known after apply)
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + description            = "Managed by Terraform."
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=192.168.1.20/24,gw=192.168.1.1,ip6=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 16384
      + name                   = "k8s-observability"
      + nameserver             = "192.168.1.3"
      + onboot                 = false
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-single"
      + skip_ipv4              = false
      + skip_ipv6              = true
      + sockets                = 2
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + sshkeys                = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIP+mJj63c+7o+Bu40wNnXwTpXkPTpGJA9OIprmNoljKI pedro@pedro-Legion-5-16IRX9"
      + tablet                 = true
      + tags                   = "terraform"
      + target_node            = "node03"
      + unused_disk            = (known after apply)
      + vm_state               = "running"
      + vmid                   = (known after apply)

      + disks {
          + ide {
              + ide1 {
                  + cloudinit {
                      + storage = "data2"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "30G"
                      + storage              = "data2"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr0"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.vm["observability.yaml"] will be destroyed
  # (because key ["observability.yaml"] is not in for_each map)
  - resource "proxmox_vm_qemu" "vm" {
      - additional_wait        = 5 -> null
      - agent                  = 1 -> null
      - agent_timeout          = 90 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0" -> null
      - cipassword             = (sensitive value) -> null
      - ciupgrade              = false -> null
      - ciuser                 = "suporte" -> null
      - clone                  = "ubuntu24-template" -> null
      - clone_wait             = 10 -> null
      - cores                  = 4 -> null
      - cpu_type               = "host" -> null
      - current_node           = "node03" -> null
      - default_ipv4_address   = "192.168.1.20" -> null
      - define_connection_info = true -> null
      - description            = "Managed by Terraform." -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "node03/qemu/102" -> null
      - ipconfig0              = "ip=192.168.1.20/24,gw=192.168.1.1,ip6=dhcp" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 16384 -> null
      - name                   = "observability" -> null
      - nameserver             = "192.168.1.3" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-single" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = true -> null
      - sockets                = 2 -> null
      - ssh_host               = "192.168.1.20" -> null
      - ssh_port               = "22" -> null
      - sshkeys                = <<-EOT
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIP+mJj63c+7o+Bu40wNnXwTpXkPTpGJA9OIprmNoljKI pedro@pedro-Legion-5-16IRX9
        EOT -> null
      - tablet                 = true -> null
      - tags                   = "terraform" -> null
      - target_node            = "node03" -> null
      - unused_disk            = [] -> null
      - vm_state               = "running" -> null
      - vmid                   = 102 -> null
        # (9 unchanged attributes hidden)

      - disks {
          - ide {
              - ide1 {
                  - ignore = false -> null

                  - cloudinit {
                      - storage = "data2" -> null
                    }
                }
            }
          - scsi {
              - scsi0 {
                  - ignore = false -> null

                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "30G" -> null
                      - storage              = "data2" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "vmbr0" -> null
          - firewall  = false -> null
          - id        = 0 -> null
          - link_down = false -> null
          - macaddr   = "bc:24:11:a0:db:61" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
        }

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

      - smbios {
          - uuid         = "ee53f805-7f59-403b-b45d-d7e9d536f3d8" -> null
            # (6 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ k8s_nodes         = {
      + "k8s-observability.yaml" = {
          + ip   = "ip=192.168.1.20/24,gw=192.168.1.1,ip6=dhcp"
          + node = "node03"
        }
        # (5 unchanged attributes hidden)
    }
  ~ vm_ips            = {
      + k8s-observability = "ip=192.168.1.20/24,gw=192.168.1.1,ip6=dhcp"
      - observability     = "ip=192.168.1.20/24,gw=192.168.1.1,ip6=dhcp"
        # (8 unchanged attributes hidden)
    }

  ```
  
  Plan exit code: 0
  